Revit 2027 API
ConduitSize Constructor
 Constructs an object that stores the basic size information for conduit.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ConduitSize(
	double nominalDiameter,
	double innerDiameter,
	double outerDiameter,
	double bendRadius,
	bool usedInSizeLists,
	bool usedInSizing
)
Public Sub New (
	nominalDiameter As Double,
	innerDiameter As Double,
	outerDiameter As Double,
	bendRadius As Double,
	usedInSizeLists As Boolean,
	usedInSizing As Boolean
)
public:
ConduitSize(
	double nominalDiameter,
	double innerDiameter,
	double outerDiameter,
	double bendRadius,
	bool usedInSizeLists,
	bool usedInSizing
)
new :
        nominalDiameter : float *
        innerDiameter : float *
        outerDiameter : float *
        bendRadius : float *
        usedInSizeLists : bool *
        usedInSizing : bool -> ConduitSize
Parameters
nominalDiameter Double
 Nominal diameter. The value should be a valid, positive Revit length.
innerDiameter Double
 Inner diameter. The value should be a valid, positive Revit length.
outerDiameter Double
 Outer diameter. The value should be a valid, positive Revit length.
bendRadius Double
 Minimum bend radius. The value should be a valid, positive Revit length.
usedInSizeLists Boolean
 Whether it is used in size lists.
usedInSizing Boolean
 Whether is used in sizing.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for nominalDiameter must be greater than 0 and no more than 30000 feet. -or- The given value for innerDiameter must be greater than 0 and no more than 30000 feet. -or- The given value for outerDiameter must be greater than 0 and no more than 30000 feet. -or- The given value for bendRadius must be greater than 0 and no more than 30000 feet.
See Also
Reference
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace